Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
		</Properties>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПартииТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПеремещениеТоваров/Forms/ФормаДокументаУ/Ext/Form/Module.bsl
&НаСервере
Процедура B1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	B1_ПрограммноеСозданиеЭлементов.СоздатьКоманду(ЭтаФорма, "B1_ЗаполнитьШК", "Заполнить ШК", "B1_ЗаполнитьШК");
	B1_ПрограммноеСозданиеЭлементов.СоздатьКнопку(ЭтаФорма, "B1_ЗаполнитьШК", Элементы.ПодменюЗаполнить, "Заполнить ШК", "B1_ЗаполнитьШК");
	
	B1_ПрограммноеСозданиеЭлементов.СоздатьКоманду(ЭтаФорма, "B1_ЗаполнитьУИН", "Заполнить УИН", "B1_ЗаполнитьУИН");
	B1_ПрограммноеСозданиеЭлементов.СоздатьКнопку(ЭтаФорма, "B1_ЗаполнитьУИН", Элементы.ПодменюЗаполнить, "Заполнить УИН", "B1_ЗаполнитьУИН");
	
КонецПроцедуры

&НаКлиенте
Процедура B1_ЗаполнитьШК(Элемент)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Запишите документ");
	КонецЕсли;
	
	МассивТоваров = ПолучитьТЧТовары();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивТоваров", МассивТоваров);
	ПараметрыОткрытия.Вставить("ИсходныйДокумент", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("B1_ЗаполнитьШК_Завершение", ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЗаполнениеШтрихкодовВТабличнойЧасти.Форма.ФормаОбработки", ПараметрыОткрытия, ЭтаФорма, , , , ОписаниеОповещения , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ОткрытьФорму("Обработка.ЗаполнениеШтрихкодовВТабличнойЧасти.Форма.ФормаОбработки", ПараметрыОткрытия, ЭтаФорма, , , ,  , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура B1_ЗаполнитьУИН(Элемент)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Запишите документ");
	КонецЕсли;
	
	МассивТоваров = ПолучитьТЧТовары();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивТоваров", МассивТоваров);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("B1_ЗаполнитьШК_Завершение", ЭтаФорма);
	
	ОткрытьФорму("Обработка.B1_ЗаполнениеУИНВСерияхНоменклатуры.Форма.Форма", ПараметрыОткрытия, ЭтаФорма, , , , ОписаниеОповещения , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура B1_ЗаполнитьШК_Завершение(ОсновныеПараметры, ДопПараметры) Экспорт
	
	Для каждого СтрокаТовара Из Объект.Товары Цикл
		ОповеститьОбИзменении(СтрокаТовара.СерияНоменклатуры);
	КонецЦикла;
	
	Элементы.Товары.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЧТовары()
	
	МассивТоваров = Новый Массив;
	
	Для каждого ТекСтрока Из Объект.Товары Цикл
		
		СтрДанных = Новый Структура;
		СтрДанных.Вставить("Номенклатура",  ТекСтрока.Номенклатура);
		СтрДанных.Вставить("ХарактеристикаНоменклатуры",  ТекСтрока.ХарактеристикаНоменклатуры);
		СтрДанных.Вставить("Размер",  ТекСтрока.Размер);
		СтрДанных.Вставить("СерияНоменклатуры",  ТекСтрока.СерияНоменклатуры);
		
		МассивТоваров.Добавить(СтрДанных);
		
	КонецЦикла;
	
	Возврат МассивТоваров;
	
КонецФункции

&НаСервере
Процедура B1_ЗаполнитьПоСкладуПослеНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПартииТоваровНаСкладахОстатки.Размер КАК Размер,
		|	ПартииТоваровНаСкладахОстатки.Качество КАК Качество,
		|	ПартииТоваровНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|	ПартииТоваровНаСкладахОстатки.ВесОстаток КАК Вес,
		|	ПартииТоваровНаСкладахОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
		|	ПартииТоваровНаСкладахОстатки.СтоимостьУпрОстаток КАК СтоимостьУпрОстаток,
		|	ПартииТоваровНаСкладахОстатки.СтоимостьБезНДСОстаток КАК СтоимостьБезНДСОстаток,
		|	ПартииТоваровНаСкладахОстатки.ВесМеталлаВПробеОстаток КАК ВесМеталлаВПробеОстаток,
		|	ПартииТоваровНаСкладахОстатки.ВесМеталлаВЧистотеОстаток КАК ВесМеталлаВЧистотеОстаток
		|ИЗ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&Дата) КАК ПартииТоваровНаСкладахОстатки
		|ГДЕ
		|	ПартииТоваровНаСкладахОстатки.Склад = &Склад
		|	И ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВесЧистоты = ЮвелирнаяТорговля.РассчитатьВесЧистоты(НоваяСтрока, Объект.УчитыватьВесВставок, Объект.РучнойУчетВесаВставок);
		Если Не Объект.РучнойУчетВесаВставок Тогда
			НоваяСтрока.ВесВставок = ЮвелирнаяТорговля.РассчитатьВесВставок(НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура B1_ЗаполнитьПоСкладуПосле(Команда)
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоСкладуЗавершение", ЭтотОбъект),
		"Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);	
	Иначе
		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Не выбран склад");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСкладуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		B1_ЗаполнитьПоСкладуПослеНаСервере();
	КонецЕсли;
КонецПроцедуры
